---
type: IExternalCommand
namespace: Autodesk.Revit.UI
version: 2024
members: 1
tags: [revit-api, class]
---

# IExternalCommand

`Autodesk.Revit.UI.IExternalCommand` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Execute | — | `Result Execute ( ExternalCommandData commandData , out string message , ElementSet elements )` |